// number，字符串
let a = new Set( [ 1, 2, 3, '3' ] ),

    // number，字符串，有重复项
    b = new Set( [ 1, 2, 1, 2, '3', '1', '3' ] ),

    // 错误 必须为数组
    /*c = new Set( {
        aa : 1,
        bb : 2,
        cc : 1,
        dd : '3',
        ee : '3'
    } ),*/
    // 错误 必须为数组
    /*d = new Set( 1, 2, 3 ),*/

    // 对象，数组
    e = new Set( [ 1, { aa : 123 }, 2, [ 1, 2, 3 ] ] ),

    // 对象，数组 ，有重复项
    f = new Set( [
        1,
        {
            aa : 123
        },
        {
            aa : 123
        },
        2,
        2,
        [
            1, 2, 3
        ],
        [
            1, 2, 3
        ],
        '3'
    ] );
// ...平铺对象项目
console.log( ...a );
// 会过滤掉重复的项，
// 过滤掉的重复项必须类型一样
console.log( ...b );
// 错误
// console.log( ...c );
// console.log( ...d );
console.log( ...e );
// 重复的项指的是相等的项（===），可以比较的项
// 对象，数组这类型不相等
console.log( ...f );
